RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
/* Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACHRXDESC_ADDR ((uint32_t)0xFFFFFFFF) /* Host receive descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACHTXBADDR_ADDR ((uint32_t)0xFFFFFFFF) /* Host transmit buffer address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACHRXBADDR_ADDR ((uint32_t)0xFFFFFFFF) /* Host receive buffer address pointer */

/******************************************************************************/
/*                                                                            */
/*                                 QSPI Registers                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for QSPI_CTRL0 register  *******************/
#define QSPI_CTRL0_DFS                              ((uint32_t)0x0000001F) /*!< DFS[4:0] bits (Data Frame Size) */
#define QSPI_CTRL0_DFS_0                            ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_CTRL0_DFS_1                            ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_CTRL0_DFS_2                            ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_CTRL0_DFS_3                            ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_CTRL0_DFS_4                            ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_CTRL0_DFS_4_BIT                                ((uint32_t)0x00000003)
#define QSPI_CTRL0_DFS_5_BIT                                ((uint32_t)0x00000004)
#define QSPI_CTRL0_DFS_6_BIT                                ((uint32_t)0x00000005)
#define QSPI_CTRL0_DFS_7_BIT                                ((uint32_t)0x00000006)
#define QSPI_CTRL0_DFS_8_BIT                                ((uint32_t)0x00000007)
#define QSPI_CTRL0_DFS_9_BIT                                ((uint32_t)0x00000008)
#define QSPI_CTRL0_DFS_10_BIT                               ((uint32_t)0x00000009)
#define QSPI_CTRL0_DFS_11_BIT                               ((uint32_t)0x0000000A)
#define QSPI_CTRL0_DFS_12_BIT                               ((uint32_t)0x0000000B)
#define QSPI_CTRL0_DFS_13_BIT                               ((uint32_t)0x0000000C)
#define QSPI_CTRL0_DFS_14_BIT                               ((uint32_t)0x0000000D)
#define QSPI_CTRL0_DFS_15_BIT                               ((uint32_t)0x0000000E)
#define QSPI_CTRL0_DFS_16_BIT                               ((uint32_t)0x0000000F)
#define QSPI_CTRL0_DFS_17_BIT                               ((uint32_t)0x00000010)
#define QSPI_CTRL0_DFS_18_BIT                               ((uint32_t)0x00000011)
#define QSPI_CTRL0_DFS_19_BIT                               ((uint32_t)0x00000012)
#define QSPI_CTRL0_DFS_20_BIT                               ((uint32_t)0x00000013)
#define QSPI_CTRL0_DFS_21_BIT                               ((uint32_t)0x00000014)
#define QSPI_CTRL0_DFS_22_BIT                               ((uint32_t)0x00000015)
#define QSPI_CTRL0_DFS_23_BIT                               ((uint32_t)0x00000016)
#define QSPI_CTRL0_DFS_24_BIT                               ((uint32_t)0x00000017)
#define QSPI_CTRL0_DFS_25_BIT                               ((uint32_t)0x00000018)
#define QSPI_CTRL0_DFS_26_BIT                               ((uint32_t)0x00000019)
#define QSPI_CTRL0_DFS_27_BIT                               ((uint32_t)0x0000001A)
#define QSPI_CTRL0_DFS_28_BIT                               ((uint32_t)0x0000001B)
#define QSPI_CTRL0_DFS_29_BIT                               ((uint32_t)0x0000001C)
#define QSPI_CTRL0_DFS_30_BIT                               ((uint32_t)0x0000001D)
#define QSPI_CTRL0_DFS_31_BIT                               ((uint32_t)0x0000001E)
#define QSPI_CTRL0_DFS_32_BIT                               ((uint32_t)0x0000001F)

#define QSPI_CTRL0_FRF                              ((uint32_t)0x000000C0) /*!< FRF[1:0] bits (Frame Format) */
#define QSPI_CTRL0_FRF_0                            ((uint32_t)0x00000040) /*!< Bit 0 */
#define QSPI_CTRL0_FRF_1                            ((uint32_t)0x00000080) /*!< Bit 1 */
#define QSPI_CTRL0_FRF_MOTOROLA                             ((uint32_t)0x00000000)
#define QSPI_CTRL0_FRF_TI                                   ((uint32_t)0x00000040)
#define QSPI_CTRL0_FRF_MICROWIRE                            ((uint32_t)0x00000080)

#define QSPI_CTRL0_SCPH                             ((uint32_t)0x00000100) /*!< SCPH (Serial Clock Phase) */
#define QSPI_CTRL0_SCPH_FIRST_EDGE                          ((uint32_t)0x00000000)
#define QSPI_CTRL0_SCPH_SECOND_EDGE                         ((uint32_t)0x00000100)

#define QSPI_CTRL0_SCPOL                            ((uint32_t)0x00000200) /*!< SCPOL(Serial Clock Polarity) */
#define QSPI_CTRL0_SCPOL_LOW                                ((uint32_t)0x00000000)
#define QSPI_CTRL0_SCPOL_HIGH                               ((uint32_t)0x00000200)

#define QSPI_CTRL0_TMOD                             ((uint32_t)0x00000C00) /*!< TMOD[1:0] bits (Transfer Mode) */
#define QSPI_CTRL0_TMOD_0                           ((uint32_t)0x00000400) /*!< Bit 0 */
#define QSPI_CTRL0_TMOD_1                           ((uint32_t)0x00000800) /*!< Bit 1 */
#define QSPI_CTRL0_TMOD_TX_AND_RX                           ((uint32_t)0x00000000)
#define QSPI_CTRL0_TMOD_TX_ONLY                             ((uint32_t)0x00000400)
#define QSPI_CTRL0_TMOD_RX_ONLY                             ((uint32_t)0x00000800)
#define QSPI_CTRL0_TMOD_EEPROM_READ                         ((uint32_t)0x00000C00)

#define QSPI_CTRL0_SRL_EN                           ((uint32_t)0x00002000) /*!< SRL (Shift Register Loop) */
#define QSPI_CTRL0_SSTE_EN                          ((uint32_t)0x00004000) /*!< SSTE(Slave Select Toggle Enable) */

#define QSPI_CTRL0_CFS                              ((uint32_t)0x000F0000) /*!< CFS[3:0] bits (Control Frame Size) */
#define QSPI_CTRL0_CFS_0                            ((uint32_t)0x00010000) /*!< Bit 0 */
#define QSPI_CTRL0_CFS_1                            ((uint32_t)0x00020000) /*!< Bit 1 */
#define QSPI_CTRL0_CFS_2                            ((uint32_t)0x00040000) /*!< Bit 2 */
#define QSPI_CTRL0_CFS_3                            ((uint32_t)0x00080000) /*!< Bit 3 */
#define QSPI_CTRL0_CFS_1_BIT                                ((uint32_t)0x00000000)
#define QSPI_CTRL0_CFS_2_BIT                                ((uint32_t)0x00010000)
#define QSPI_CTRL0_CFS_3_BIT                                ((uint32_t)0x00020000)
#define QSPI_CTRL0_CFS_4_BIT                                ((uint32_t)0x00030000)
#define QSPI_CTRL0_CFS_5_BIT                                ((uint32_t)0x00040000)
#define QSPI_CTRL0_CFS_6_BIT                                ((uint32_t)0x00050000)
#define QSPI_CTRL0_CFS_7_BIT                                ((uint32_t)0x00060000)
#define QSPI_CTRL0_CFS_8_BIT                                ((uint32_t)0x00070000)
#define QSPI_CTRL0_CFS_9_BIT                                ((uint32_t)0x00080000)
#define QSPI_CTRL0_CFS_10_BIT                               ((uint32_t)0x00090000)
#define QSPI_CTRL0_CFS_11_BIT                               ((uint32_t)0x000A0000)
#define QSPI_CTRL0_CFS_12_BIT                               ((uint32_t)0x000B0000)
#define QSPI_CTRL0_CFS_13_BIT                               ((uint32_t)0x000C0000)
#define QSPI_CTRL0_CFS_14_BIT                               ((uint32_t)0x000D0000)
#define QSPI_CTRL0_CFS_15_BIT                               ((uint32_t)0x000E0000)
#define QSPI_CTRL0_CFS_16_BIT                               ((uint32_t)0x000F0000)

#define QSPI_CTRL0_SPI_FRF                          ((uint32_t)0x00C00000) /*!< SPI_FRF[1:0] bits (SPI Frame Format) */
#define QSPI_CTRL0_SPI_FRF_0                        ((uint32_t)0x00400000) /*!< Bit 0 */
#define QSPI_CTRL0_SPI_FRF_1                        ((uint32_t)0x00800000) /*!< Bit 1 */
#define QSPI_CTRL0_SPI_FRF_STANDARD_FORMAT                  ((uint32_t)0x00000000)
#define QSPI_CTRL0_SPI_FRF_DUAL_FORMAT                      ((uint32_t)0x00400000)
#define QSPI_CTRL0_SPI_FRF_QUAD_FORMAT                      ((uint32_t)0x00800000)

/*******************  Bit definition for QSPI_CTRL1 register  *******************/
#define QSPI_CTRL1_NDF                              ((uint32_t)0x0000FFFF) /*!< NDF[15:0] bits (Numver of Data Frames) */
#define QSPI_CTRL1_NDF_0                            ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_CTRL1_NDF_1                            ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_CTRL1_NDF_2                            ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_CTRL1_NDF_3                            ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_CTRL1_NDF_4                            ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_CTRL1_NDF_5                            ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_CTRL1_NDF_6                            ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_CTRL1_NDF_7                            ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_CTRL1_NDF_8                            ((uint32_t)0x00000100) /*!< Bit 8 */
#define QSPI_CTRL1_NDF_9                            ((uint32_t)0x00000200) /*!< Bit 9 */
#define QSPI_CTRL1_NDF_10                           ((uint32_t)0x00000400) /*!< Bit 10 */
#define QSPI_CTRL1_NDF_11                           ((uint32_t)0x00000800) /*!< Bit 11 */
#define QSPI_CTRL1_NDF_12                           ((uint32_t)0x00001000) /*!< Bit 12 */
#define QSPI_CTRL1_NDF_13                           ((uint32_t)0x00002000) /*!< Bit 13 */
#define QSPI_CTRL1_NDF_14                           ((uint32_t)0x00004000) /*!< Bit 14 */
#define QSPI_CTRL1_NDF_15                           ((uint32_t)0x00008000) /*!< Bit 15 */

/*******************  Bit definition for QSPI_EN_QEN register  *******************/
#define QSPI_EN_QEN                                 ((uint32_t)0x00000001) /*!< QEN (QSPI Enable) */

