RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
/*******************  Bit definition for QSPI_RS_DELAY register  *******************/
#define QSPI_RS_DELAY_SDCN                          ((uint32_t)0x000000FF) /*!< SDCN[7:0] (Sample Delay Cycle Number) */
#define QSPI_RS_DELAY_SDCN_0                        ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_RS_DELAY_SDCN_1                        ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_RS_DELAY_SDCN_2                        ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_RS_DELAY_SDCN_3                        ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_RS_DELAY_SDCN_4                        ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_RS_DELAY_SDCN_5                        ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_RS_DELAY_SDCN_6                        ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_RS_DELAY_SDCN_7                        ((uint32_t)0x00000080) /*!< Bit 7 */
#define QSPI_RS_DELAY_SDCN_0_CYCLES                             ((uint32_t)0x00000000)
#define QSPI_RS_DELAY_SDCN_1_CYCLES                             ((uint32_t)0x00000001)
#define QSPI_RS_DELAY_SDCN_2_CYCLES                             ((uint32_t)0x00000002)
#define QSPI_RS_DELAY_SDCN_3_CYCLES                             ((uint32_t)0x00000003)
#define QSPI_RS_DELAY_SDCN_4_CYCLES                             ((uint32_t)0x00000004)
#define QSPI_RS_DELAY_SDCN_5_CYCLES                             ((uint32_t)0x00000005)
#define QSPI_RS_DELAY_SDCN_6_CYCLES                             ((uint32_t)0x00000006)

#define QSPI_RS_DELAY_SES                               ((uint32_t)0x00010000) /*!< SES (Sample Edge Select of Receive Data) */
#define QSPI_RS_DELAY_SES_RISING_EDGE                           ((uint32_t)0x00000000)
#define QSPI_RS_DELAY_SES_FALLING_EDGE                          ((uint32_t)0x00010000)
/*******************  Bit definition for QSPI_ENH_CTRL0 register  *******************/
#define QSPI_ENH_CTRL0_TRANS_TYPE                   ((uint32_t)0x00000003) /*!< TRANS_TYPE[1:0] (Address and instruction transfer format) */
#define QSPI_ENH_CTRL0_TRANS_TYPE_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_ENH_CTRL0_TRANS_TYPE_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_ENH_CTRL0_TRANS_TYPE_STANDARD          ((uint32_t)0x00000000)
#define QSPI_ENH_CTRL0_TRANS_TYPE_ADDRESS_BY_FRF    ((uint32_t)0x00000001)
#define QSPI_ENH_CTRL0_TRANS_TYPE_ALL_BY_FRF        ((uint32_t)0x00000002)

#define QSPI_ENH_CTRL0_ADDR_LEN                     ((uint32_t)0x0000003C) /*!< ADDR_LEN[3:0] (Length of Address to transmit) */
#define QSPI_ENH_CTRL0_ADDR_LEN_0                   ((uint32_t)0x00000004) /*!< Bit 0 */
#define QSPI_ENH_CTRL0_ADDR_LEN_1                   ((uint32_t)0x00000008) /*!< Bit 1 */
#define QSPI_ENH_CTRL0_ADDR_LEN_2                   ((uint32_t)0x00000010) /*!< Bit 2 */
#define QSPI_ENH_CTRL0_ADDR_LEN_3                   ((uint32_t)0x00000020) /*!< Bit 3 */
#define QSPI_ENH_CTRL0_ADDR_LEN_4_BIT               ((uint32_t)0x00000004)
#define QSPI_ENH_CTRL0_ADDR_LEN_8_BIT               ((uint32_t)0x00000008)
#define QSPI_ENH_CTRL0_ADDR_LEN_12_BIT              ((uint32_t)0x0000000C)
#define QSPI_ENH_CTRL0_ADDR_LEN_16_BIT              ((uint32_t)0x00000010)
#define QSPI_ENH_CTRL0_ADDR_LEN_20_BIT              ((uint32_t)0x00000014)
#define QSPI_ENH_CTRL0_ADDR_LEN_24_BIT              ((uint32_t)0x00000018)
#define QSPI_ENH_CTRL0_ADDR_LEN_28_BIT              ((uint32_t)0x0000001C)
#define QSPI_ENH_CTRL0_ADDR_LEN_32_BIT              ((uint32_t)0x00000020)
#define QSPI_ENH_CTRL0_ADDR_LEN_36_BIT              ((uint32_t)0x00000024)
#define QSPI_ENH_CTRL0_ADDR_LEN_40_BIT              ((uint32_t)0x00000028)
#define QSPI_ENH_CTRL0_ADDR_LEN_44_BIT              ((uint32_t)0x0000002C)
#define QSPI_ENH_CTRL0_ADDR_LEN_48_BIT              ((uint32_t)0x00000030)
#define QSPI_ENH_CTRL0_ADDR_LEN_52_BIT              ((uint32_t)0x00000034)
#define QSPI_ENH_CTRL0_ADDR_LEN_56_BIT              ((uint32_t)0x00000038)
#define QSPI_ENH_CTRL0_ADDR_LEN_60_BIT              ((uint32_t)0x0000003C)

#define QSPI_ENH_CTRL0_INST_L                       ((uint32_t)0x00000300) /*!< INST_L[1:0] (Dual/Quad mode instruction length in bits) */
#define QSPI_ENH_CTRL0_INST_L_0                     ((uint32_t)0x00000100) /*!< Bit 0 */
#define QSPI_ENH_CTRL0_INST_L_1                     ((uint32_t)0x00000200) /*!< Bit 1 */
#define QSPI_ENH_CTRL0_INST_L_0_LINE                ((uint32_t)0x00000000)
#define QSPI_ENH_CTRL0_INST_L_4_LINE                ((uint32_t)0x00000100)
#define QSPI_ENH_CTRL0_INST_L_8_LINE                ((uint32_t)0x00000200)
#define QSPI_ENH_CTRL0_INST_L_16_LINE               ((uint32_t)0x00000300)

#define QSPI_ENH_CTRL0_WAIT_CYCLES                  ((uint32_t)0x0000F800) /*!< WAIT_CYCLES[4:0] (Wait Cycles in Dual/Quad mode between control frames transmit and data reception) */
#define QSPI_ENH_CTRL0_WAIT_CYCLES_0                ((uint32_t)0x00000800) /*!< Bit 0 */
#define QSPI_ENH_CTRL0_WAIT_CYCLES_1                ((uint32_t)0x00001000) /*!< Bit 1 */
#define QSPI_ENH_CTRL0_WAIT_CYCLES_2                ((uint32_t)0x00002000) /*!< Bit 2 */
#define QSPI_ENH_CTRL0_WAIT_CYCLES_3                ((uint32_t)0x00004000) /*!< Bit 3 */
#define QSPI_ENH_CTRL0_WAIT_CYCLES_4                ((uint32_t)0x00008000) /*!< Bit 4 */
#define QSPI_ENH_CTRL0_WAIT_1CYCLES                 ((uint32_t)0x00000800)
#define QSPI_ENH_CTRL0_WAIT_2CYCLES                 ((uint32_t)0x00001000)
#define QSPI_ENH_CTRL0_WAIT_3CYCLES                 ((uint32_t)0x00001800)
#define QSPI_ENH_CTRL0_WAIT_4CYCLES                 ((uint32_t)0x00002000)
#define QSPI_ENH_CTRL0_WAIT_5CYCLES                 ((uint32_t)0x00002800)
#define QSPI_ENH_CTRL0_WAIT_6CYCLES                 ((uint32_t)0x00003000)
#define QSPI_ENH_CTRL0_WAIT_7CYCLES                 ((uint32_t)0x00003800)
#define QSPI_ENH_CTRL0_WAIT_8CYCLES                 ((uint32_t)0x00004000)
#define QSPI_ENH_CTRL0_WAIT_9CYCLES                 ((uint32_t)0x00004800)
#define QSPI_ENH_CTRL0_WAIT_10CYCLES                ((uint32_t)0x00005000)
#define QSPI_ENH_CTRL0_WAIT_11CYCLES                ((uint32_t)0x00005800)
#define QSPI_ENH_CTRL0_WAIT_12CYCLES                ((uint32_t)0x00006000)
#define QSPI_ENH_CTRL0_WAIT_13CYCLES                ((uint32_t)0x00006800)
#define QSPI_ENH_CTRL0_WAIT_14CYCLES                ((uint32_t)0x00007000)
#define QSPI_ENH_CTRL0_WAIT_15CYCLES                ((uint32_t)0x00007800)
#define QSPI_ENH_CTRL0_WAIT_16CYCLES                ((uint32_t)0x00008000)
#define QSPI_ENH_CTRL0_WAIT_17CYCLES                ((uint32_t)0x00008800)
#define QSPI_ENH_CTRL0_WAIT_18CYCLES                ((uint32_t)0x00009000)
#define QSPI_ENH_CTRL0_WAIT_19CYCLES                ((uint32_t)0x00009800)
#define QSPI_ENH_CTRL0_WAIT_20CYCLES                ((uint32_t)0x0000A000)
#define QSPI_ENH_CTRL0_WAIT_21CYCLES                ((uint32_t)0x0000A800)
#define QSPI_ENH_CTRL0_WAIT_22CYCLES                ((uint32_t)0x0000B000)
#define QSPI_ENH_CTRL0_WAIT_23CYCLES                ((uint32_t)0x0000B800)
#define QSPI_ENH_CTRL0_WAIT_24CYCLES                ((uint32_t)0x0000C000)
#define QSPI_ENH_CTRL0_WAIT_25CYCLES                ((uint32_t)0x0000C800)
#define QSPI_ENH_CTRL0_WAIT_26CYCLES                ((uint32_t)0x0000D000)
#define QSPI_ENH_CTRL0_WAIT_27CYCLES                ((uint32_t)0x0000D800)
#define QSPI_ENH_CTRL0_WAIT_28CYCLES                ((uint32_t)0x0000E000)
#define QSPI_ENH_CTRL0_WAIT_29CYCLES                ((uint32_t)0x0000E800)
#define QSPI_ENH_CTRL0_WAIT_30CYCLES                ((uint32_t)0x0000F000)
#define QSPI_ENH_CTRL0_WAIT_31CYCLES                ((uint32_t)0x0000F800)

