RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
#define QSPI_XIP_CTRL_ADDR_LEN            ((uint32_t)0x000000F0) /*!< ADDR_LEN[3:0] (Length of Address to transmit) */
#define QSPI_XIP_CTRL_ADDR_LEN_0          ((uint32_t)0x00000010) /*!< Bit 0 */
#define QSPI_XIP_CTRL_ADDR_LEN_1          ((uint32_t)0x00000020) /*!< Bit 1 */
#define QSPI_XIP_CTRL_ADDR_LEN_2          ((uint32_t)0x00000040) /*!< Bit 2 */
#define QSPI_XIP_CTRL_ADDR_LEN_3          ((uint32_t)0x00000080) /*!< Bit 3 */
#define QSPI_XIP_CTRL_ADDR_4BIT           ((uint32_t)0x00000010)
#define QSPI_XIP_CTRL_ADDR_8BIT           ((uint32_t)0x00000020)
#define QSPI_XIP_CTRL_ADDR_12BIT          ((uint32_t)0x00000030)
#define QSPI_XIP_CTRL_ADDR_16BIT          ((uint32_t)0x00000040)
#define QSPI_XIP_CTRL_ADDR_20BIT          ((uint32_t)0x00000050)
#define QSPI_XIP_CTRL_ADDR_24BIT          ((uint32_t)0x00000060)
#define QSPI_XIP_CTRL_ADDR_28BIT          ((uint32_t)0x00000070)
#define QSPI_XIP_CTRL_ADDR_32BIT          ((uint32_t)0x00000080)
#define QSPI_XIP_CTRL_ADDR_36BIT          ((uint32_t)0x00000090)
#define QSPI_XIP_CTRL_ADDR_40BIT          ((uint32_t)0x000000A0)
#define QSPI_XIP_CTRL_ADDR_44BIT          ((uint32_t)0x000000B0)
#define QSPI_XIP_CTRL_ADDR_48BIT          ((uint32_t)0x000000C0)
#define QSPI_XIP_CTRL_ADDR_52BIT          ((uint32_t)0x000000D0)
#define QSPI_XIP_CTRL_ADDR_56BIT          ((uint32_t)0x000000E0)
#define QSPI_XIP_CTRL_ADDR_60BIT          ((uint32_t)0x000000F0)

#define QSPI_XIP_CTRL_INST_L              ((uint32_t)0x00000600) /*!< INST_L[1:0] (Dual/Quad mode instruction length in bits) */
#define QSPI_XIP_CTRL_INST_L_0            ((uint32_t)0x00000200) /*!< Bit 0 */
#define QSPI_XIP_CTRL_INST_L_1            ((uint32_t)0x00000400) /*!< Bit 1 */
#define QSPI_XIP_CTRL_INST_L_0_LINE       ((uint32_t)0x00000000)
#define QSPI_XIP_CTRL_INST_L_4_LINE       ((uint32_t)0x00000200)
#define QSPI_XIP_CTRL_INST_L_8_LINE       ((uint32_t)0x00000400)
#define QSPI_XIP_CTRL_INST_L_16_LINE      ((uint32_t)0x00000600)

#define QSPI_XIP_CTRL_MD_BIT_EN           ((uint32_t)0x00001000) /*!< MD_BIT_EN (Mode bits enable in XIP mode) */

#define QSPI_XIP_CTRL_WAIT_CYCLES         ((uint32_t)0x0003E000) /*!< WAIT_CYCLES[4:0] (Wait Cycles in Dual/Quad mode between control frames transmit and data reception) */
#define QSPI_XIP_CTRL_WAIT_CYCLES_0       ((uint32_t)0x00002000) /*!< Bit 0 */
#define QSPI_XIP_CTRL_WAIT_CYCLES_1       ((uint32_t)0x00004000) /*!< Bit 1 */
#define QSPI_XIP_CTRL_WAIT_CYCLES_2       ((uint32_t)0x00008000) /*!< Bit 2 */
#define QSPI_XIP_CTRL_WAIT_CYCLES_3       ((uint32_t)0x00010000) /*!< Bit 3 */
#define QSPI_XIP_CTRL_WAIT_CYCLES_4       ((uint32_t)0x00020000) /*!< Bit 4 */
#define QSPI_XIP_CTRL_WAIT_1CYCLES        ((uint32_t)0x00002000)
#define QSPI_XIP_CTRL_WAIT_2CYCLES        ((uint32_t)0x00004000)
#define QSPI_XIP_CTRL_WAIT_3CYCLES        ((uint32_t)0x00006000)
#define QSPI_XIP_CTRL_WAIT_4CYCLES        ((uint32_t)0x00008000)
#define QSPI_XIP_CTRL_WAIT_5CYCLES        ((uint32_t)0x0000A000)
#define QSPI_XIP_CTRL_WAIT_6CYCLES        ((uint32_t)0x0000C000)
#define QSPI_XIP_CTRL_WAIT_7CYCLES        ((uint32_t)0x0000E000)
#define QSPI_XIP_CTRL_WAIT_8CYCLES        ((uint32_t)0x00010000)
#define QSPI_XIP_CTRL_WAIT_9CYCLES        ((uint32_t)0x00012000)
#define QSPI_XIP_CTRL_WAIT_10CYCLES       ((uint32_t)0x00014000)
#define QSPI_XIP_CTRL_WAIT_11CYCLES       ((uint32_t)0x00016000)
#define QSPI_XIP_CTRL_WAIT_12CYCLES       ((uint32_t)0x00018000)
#define QSPI_XIP_CTRL_WAIT_13CYCLES       ((uint32_t)0x0001A000)
#define QSPI_XIP_CTRL_WAIT_14CYCLES       ((uint32_t)0x0001C000)
#define QSPI_XIP_CTRL_WAIT_15CYCLES       ((uint32_t)0x0001E000)
#define QSPI_XIP_CTRL_WAIT_16CYCLES       ((uint32_t)0x00020000)
#define QSPI_XIP_CTRL_WAIT_17CYCLES       ((uint32_t)0x00022000)
#define QSPI_XIP_CTRL_WAIT_18CYCLES       ((uint32_t)0x00024000)
#define QSPI_XIP_CTRL_WAIT_19CYCLES       ((uint32_t)0x00026000)
#define QSPI_XIP_CTRL_WAIT_20CYCLES       ((uint32_t)0x00028000)
#define QSPI_XIP_CTRL_WAIT_21CYCLES       ((uint32_t)0x0002A000)
#define QSPI_XIP_CTRL_WAIT_22CYCLES       ((uint32_t)0x0002C000)
#define QSPI_XIP_CTRL_WAIT_23CYCLES       ((uint32_t)0x0002E000)
#define QSPI_XIP_CTRL_WAIT_24CYCLES       ((uint32_t)0x00030000)
#define QSPI_XIP_CTRL_WAIT_25CYCLES       ((uint32_t)0x00032000)
#define QSPI_XIP_CTRL_WAIT_26CYCLES       ((uint32_t)0x00034000)
#define QSPI_XIP_CTRL_WAIT_27CYCLES       ((uint32_t)0x00036000)
#define QSPI_XIP_CTRL_WAIT_28CYCLES       ((uint32_t)0x00038000)
#define QSPI_XIP_CTRL_WAIT_29CYCLES       ((uint32_t)0x0003A000)
#define QSPI_XIP_CTRL_WAIT_30CYCLES       ((uint32_t)0x0003C000)
#define QSPI_XIP_CTRL_WAIT_31CYCLES       ((uint32_t)0x0003E000)

#define QSPI_XIP_CTRL_DFS_HC              ((uint32_t)0x00040000) /*!< DFS_HC (Fix DFS for XIP transfers) */
#define QSPI_XIP_CTRL_DDR_EN              ((uint32_t)0x00080000) /*!< DDR_EN (SPI DDR Enable) */
#define QSPI_XIP_CTRL_INST_DDR_EN         ((uint32_t)0x00100000) /*!< INST_DDR_EN (XIP instruction enable) */
#define QSPI_XIP_CTRL_XIP_INST_EN         ((uint32_t)0x00400000) /*!< XIP_INST_EN (XIP instruction enable) */
#define QSPI_XIP_CTRL_XIP_CT_EN           ((uint32_t)0x00800000) /*!< XIP_CT_EN (Enable Continuous Transfer in XIP mode) */

#define QSPI_XIP_CTRL_XIP_MBL             ((uint32_t)0x0C000000) /*!< XIP_MBL[1:0] (XIP Mode bits length) */
#define QSPI_XIP_CTRL_XIP_MBL_0           ((uint32_t)0x04000000) /*!< Bit 0 */
#define QSPI_XIP_CTRL_XIP_MBL_1           ((uint32_t)0x08000000) /*!< Bit 1 */
#define QSPI_XIP_CTRL_XIP_MBL_LEN_2_BIT   ((uint32_t)0x00000000)
#define QSPI_XIP_CTRL_XIP_MBL_LEN_4_BIT   ((uint32_t)0x04000000)
#define QSPI_XIP_CTRL_XIP_MBL_LEN_8_BIT   ((uint32_t)0x08000000)
#define QSPI_XIP_CTRL_XIP_MBL_LEN_16_BIT  ((uint32_t)0x0C000000)

/*******************  Bit definition for QSPI_XIP_SLAVE_EN register  *******************/
#define QSPI_XIP_SLAVE_EN_SEN             ((uint32_t)0x00000001) /*!< SEN (Slave Enable) */

/*******************  Bit definition for QSPI_XIP_RXFOI_CLR register  *******************/
#define QSPI_XIP_RXFOI_CLR_XRXFOIC        ((uint32_t)0x00000001) /*!< XRXFOIC (Clear XIP Receive FIFO Overflow Interrupt) */

