RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
/*******************  Bit definition for QSPI_XIP_OUT register  *******************/
#define QSPI_XIP_OUT_XTOUT                ((uint32_t)0x0000FFFF) /*!< XTOUT[7:0] (XIP time out value in terms of HCLK) */
#define QSPI_XIP_OUT_XTOUT_0              ((uint32_t)0x00000001) /*!< Bit 0 */
#define QSPI_XIP_OUT_XTOUT_1              ((uint32_t)0x00000002) /*!< Bit 1 */
#define QSPI_XIP_OUT_XTOUT_2              ((uint32_t)0x00000004) /*!< Bit 2 */
#define QSPI_XIP_OUT_XTOUT_3              ((uint32_t)0x00000008) /*!< Bit 3 */
#define QSPI_XIP_OUT_XTOUT_4              ((uint32_t)0x00000010) /*!< Bit 4 */
#define QSPI_XIP_OUT_XTOUT_5              ((uint32_t)0x00000020) /*!< Bit 5 */
#define QSPI_XIP_OUT_XTOUT_6              ((uint32_t)0x00000040) /*!< Bit 6 */
#define QSPI_XIP_OUT_XTOUT_7              ((uint32_t)0x00000080) /*!< Bit 7 */
/******************************************************************************/
/*                                                                            */
/*                                 TSC Registers                              */
/*                                                                            */
/******************************************************************************/
/****************  Bit definition for TSC_CTRL register         ****************/
#define TSC_CTRL_TM2_ETR_CH1_SHIFT      (13U)
#define TSC_CTRL_TM2_ETR_CH1_MASK       (0x1UL << TSC_CTRL_TM2_ETR_CH1_SHIFT)
#define TSC_CTRL_TM2_ETR_CH1            (TSC_CTRL_TM2_ETR_CH1_MASK)      /*!<TSC_out connected to TIM2_ETR and TIM2_CH1*/

#define TSC_CTRL_TM4_ETR_SHIFT          (12U)
#define TSC_CTRL_TM4_ETR_MASK           (0x1UL << TSC_CTRL_TM4_ETR_SHIFT)
#define TSC_CTRL_TM4_ETR                (TSC_CTRL_TM4_ETR_MASK)          /*!<TSC_out connected to TIM4_ETR*/

#define TSC_CTRL_DET_INTEN_SHIFT        (10U)
#define TSC_CTRL_DET_INTEN_MASK         (0x1UL << TSC_CTRL_DET_INTEN_SHIFT)
#define TSC_CTRL_DET_INTEN              (TSC_CTRL_DET_INTEN_MASK)        /*!<TSC interrupt control bit*/

#define TSC_CTRL_GREAT_DET_SEL_SHIFT    (9U)
#define TSC_CTRL_GREAT_DET_SEL_MASK     (0x1UL << TSC_CTRL_GREAT_DET_SEL_SHIFT)
#define TSC_CTRL_GREAT_DET_SEL          (TSC_CTRL_GREAT_DET_SEL_MASK)    /*!<TSC great detect control*/

#define TSC_CTRL_LESS_DET_SEL_SHIFT     (8U)
#define TSC_CTRL_LESS_DET_SEL_MASK      (0x1UL << TSC_CTRL_LESS_DET_SEL_SHIFT)
#define TSC_CTRL_LESS_DET_SEL           (TSC_CTRL_LESS_DET_SEL_MASK)     /*!<TSC less detect control*/

#define TSC_CTRL_HW_DET_ST_SHIFT        (7U)
#define TSC_CTRL_HW_DET_ST_MASK         (0x1UL << TSC_CTRL_HW_DET_ST_SHIFT)
#define TSC_CTRL_HW_DET_ST              (TSC_CTRL_HW_DET_ST_MASK)        /*!<Status of TSC hardware detect mode*/

#define TSC_CTRL_HW_DET_MODE_SHIFT      (6U)
#define TSC_CTRL_HW_DET_MODE_MASK       (0x1UL << TSC_CTRL_HW_DET_MODE_SHIFT)
#define TSC_CTRL_HW_DET_MODE            (TSC_CTRL_HW_DET_MODE_MASK)      /*!<TSC hardware detect mode control*/

#define TSC_CTRL_DET_FILTER_SHIFT       (4U)
#define TSC_CTRL_DET_FILTER_MASK        (0x3UL << TSC_CTRL_DET_FILTER_SHIFT)
#define TSC_CTRL_DET_FILTER             (TSC_CTRL_DET_FILTER_MASK)       /*!<TSC filter for continuously detect */
#define TSC_CTRL_DET_FILTER_0           (0x1UL << TSC_CTRL_DET_FILTER_SHIFT)
#define TSC_CTRL_DET_FILTER_1           (0x2UL << TSC_CTRL_DET_FILTER_SHIFT)

#define TSC_CTRL_DET_PERIOD_SHIFT       (0U)
#define TSC_CTRL_DET_PERIOD_MASK        (0xFUL << TSC_CTRL_DET_PERIOD_SHIFT)
#define TSC_CTRL_DET_PERIOD             (TSC_CTRL_DET_PERIOD_MASK)       /*!<TSC detect time of one sample */
#define TSC_CTRL_DET_PERIOD_0           (0x1UL << TSC_CTRL_DET_PERIOD_SHIFT)
#define TSC_CTRL_DET_PERIOD_1           (0x2UL << TSC_CTRL_DET_PERIOD_SHIFT)
#define TSC_CTRL_DET_PERIOD_2           (0x4UL << TSC_CTRL_DET_PERIOD_SHIFT)
#define TSC_CTRL_DET_PERIOD_3           (0x8UL << TSC_CTRL_DET_PERIOD_SHIFT)

/****************  Bit definition for TSC TSC_CHNEN register    ****************/
#define TSC_CHNEN_CHN_SEL_MASK          (0x00FFFFFF)
#define TSC_CHNEN_CHN_SEL_SHIFT         (0U)
#define TSC_CHNEN_CHN_SEL0              (0x1UL << 0) /*!< Channel 0 enable bit */
#define TSC_CHNEN_CHN_SEL1              (0x1UL << 1) /*!< Channel 1 enable bit */
#define TSC_CHNEN_CHN_SEL2              (0x1UL << 2) /*!< Channel 2 enable bit */
#define TSC_CHNEN_CHN_SEL3              (0x1UL << 3) /*!< Channel 3 enable bit */
#define TSC_CHNEN_CHN_SEL4              (0x1UL << 4) /*!< Channel 4 enable bit */
#define TSC_CHNEN_CHN_SEL5              (0x1UL << 5) /*!< Channel 5 enable bit */
#define TSC_CHNEN_CHN_SEL6              (0x1UL << 6) /*!< Channel 6 enable bit */
#define TSC_CHNEN_CHN_SEL7              (0x1UL << 7) /*!< Channel 7 enable bit */
#define TSC_CHNEN_CHN_SEL8              (0x1UL << 8) /*!< Channel 8 enable bit */
#define TSC_CHNEN_CHN_SEL9              (0x1UL << 9) /*!< Channel 9 enable bit */
#define TSC_CHNEN_CHN_SEL10             (0x1UL << 10) /*!< Channel 10 enable bit */
#define TSC_CHNEN_CHN_SEL11             (0x1UL << 11) /*!< Channel 11 enable bit */
#define TSC_CHNEN_CHN_SEL12             (0x1UL << 12) /*!< Channel 12 enable bit */
#define TSC_CHNEN_CHN_SEL13             (0x1UL << 13) /*!< Channel 13 enable bit */
#define TSC_CHNEN_CHN_SEL14             (0x1UL << 14) /*!< Channel 14 enable bit */
#define TSC_CHNEN_CHN_SEL15             (0x1UL << 15) /*!< Channel 15 enable bit */
#define TSC_CHNEN_CHN_SEL16             (0x1UL << 16) /*!< Channel 16 enable bit */
#define TSC_CHNEN_CHN_SEL17             (0x1UL << 17) /*!< Channel 17 enable bit */
#define TSC_CHNEN_CHN_SEL18             (0x1UL << 18) /*!< Channel 18 enable bit */
#define TSC_CHNEN_CHN_SEL19             (0x1UL << 19) /*!< Channel 19 enable bit */
#define TSC_CHNEN_CHN_SEL20             (0x1UL << 20) /*!< Channel 20 enable bit */
#define TSC_CHNEN_CHN_SEL21             (0x1UL << 21) /*!< Channel 21 enable bit */
#define TSC_CHNEN_CHN_SEL22             (0x1UL << 22) /*!< Channel 22 enable bit */
#define TSC_CHNEN_CHN_SEL23             (0x1UL << 23) /*!< Channel 23 enable bit */

/****************  Bit definition for TSC TSC_STS register      ****************/
#define TSC_STS_CHN_NUM_SHIFT           (16U)
#define TSC_STS_CHN_NUM_MASK            (0x1FUL << TSC_STS_CHN_NUM_SHIFT)
#define TSC_STS_CHN_NUM                 TSC_STS_CHN_NUM_MASK     /*!<Current detect channel number */
#define TSC_STS_CHN_NUM_0               (0x1UL  << TSC_STS_CHN_NUM_SHIFT)
#define TSC_STS_CHN_NUM_1               (0x2UL  << TSC_STS_CHN_NUM_SHIFT)
#define TSC_STS_CHN_NUM_2               (0x4UL  << TSC_STS_CHN_NUM_SHIFT)
#define TSC_STS_CHN_NUM_3               (0x8UL  << TSC_STS_CHN_NUM_SHIFT)
#define TSC_STS_CHN_NUM_4               (0x10UL << TSC_STS_CHN_NUM_SHIFT)

#define TSC_STS_GREAT_DET_SHIFT         (13U)
#define TSC_STS_GREAT_DET_MASK          (0x1UL << TSC_STS_GREAT_DET_SHIFT)
#define TSC_STS_GREAT_DET               TSC_STS_GREAT_DET_MASK   /*!<Status of TSC great detect*/

#define TSC_STS_LESS_DET_SHIFT          (12U)
#define TSC_STS_LESS_DET_MASK           (0x1UL << TSC_STS_LESS_DET_SHIFT)
#define TSC_STS_LESS_DET                TSC_STS_LESS_DET_MASK    /*!<Status of TSC less detect*/

#define TSC_STS_CNT_VAL_SHIFT           (0U)
#define TSC_STS_CNT_VAL_MASK            (0x7FFUL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL                 TSC_STS_CNT_VAL_MASK     /*!<The pulse count value for current channel*/
#define TSC_STS_CNT_VAL_0               (0x001UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_1               (0x002UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_2               (0x004UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_3               (0x008UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_4               (0x010UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_5               (0x020UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_6               (0x040UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_7               (0x080UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_8               (0x100UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_9               (0x200UL << TSC_STS_CNT_VAL_SHIFT)
#define TSC_STS_CNT_VAL_10              (0x400UL << TSC_STS_CNT_VAL_SHIFT)

