RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
/****************  Bit definition for TSC_ANA_CTRL register      ****************/
#define TSC_ANA_CTRL_SW_TSC_EN_SHIFT    (5U)
#define TSC_ANA_CTRL_SW_TSC_EN_MASK     (0x1UL << TSC_ANA_CTRL_SW_TSC_EN_SHIFT)
#define TSC_ANA_CTRL_SW_TSC_EN          TSC_ANA_CTRL_SW_TSC_EN_MASK  /*!<TSC software detect mode control bit*/

#define TSC_ANA_CTRL_SW_PAD_MUX_SHIFT   (0U)
#define TSC_ANA_CTRL_SW_PAD_MUX_MASK    (0x1FUL << TSC_ANA_CTRL_SW_PAD_MUX_SHIFT)
#define TSC_ANA_CTRL_SW_PAD_MUX         TSC_ANA_CTRL_SW_PAD_MUX_MASK /*!<Current channel number of TSC software detect mode*/
#define TSC_ANA_CTRL_SW_PAD_MUX_0       (0x01UL << TSC_ANA_CTRL_SW_PAD_MUX_SHIFT)
#define TSC_ANA_CTRL_SW_PAD_MUX_1       (0x02UL << TSC_ANA_CTRL_SW_PAD_MUX_SHIFT)
#define TSC_ANA_CTRL_SW_PAD_MUX_2       (0x04UL << TSC_ANA_CTRL_SW_PAD_MUX_SHIFT)
#define TSC_ANA_CTRL_SW_PAD_MUX_3       (0x08UL << TSC_ANA_CTRL_SW_PAD_MUX_SHIFT)
#define TSC_ANA_CTRL_SW_PAD_MUX_4       (0x10UL << TSC_ANA_CTRL_SW_PAD_MUX_SHIFT)


/****************  Bit definition for TSC_ANA_SEL register      ****************/
#define TSC_ANA_SEL_PAD_OPT_SHIFT       (6U)
#define TSC_ANA_SEL_PAD_OPT_MASK        (0x01UL << TSC_ANA_SEL_PAD_OPT_SHIFT)
#define TSC_ANA_SEL_PAD_OPT             TSC_ANA_SEL_PAD_OPT_MASK     /*!<TSC charge pad control bit,internal or external resistor*/

#define TSC_ANA_SEL_SP_OPT_SHIFT        (4U)
#define TSC_ANA_SEL_SP_OPT_MASK         (0x3UL << TSC_ANA_SEL_SP_OPT_SHIFT)
#define TSC_ANA_SEL_SP_OPT              TSC_ANA_SEL_SP_OPT_MASK          /*!<TSC speed control bits*/
#define TSC_ANA_SEL_SP_OPT_0            (0x1UL << TSC_ANA_SEL_SP_OPT_SHIFT)
#define TSC_ANA_SEL_SP_OPT_1            (0x2UL << TSC_ANA_SEL_SP_OPT_SHIFT)

/*****************  Resistor value of  TSC_RESRx register  *****************/
#define TSC_RESR_CHN_RESIST_MASK        (0x7UL) /*!< TSC_RESR 0 channel 0 */
#define TSC_RESR_CHN_RESIST_1M          (0x0UL) /*!< 1M ohm */
#define TSC_RESR_CHN_RESIST_875K        (0x1UL) /*!< 875K 0hm */
#define TSC_RESR_CHN_RESIST_750K        (0x2UL) /*!< 750K ohm */
#define TSC_RESR_CHN_RESIST_625K        (0x3UL) /*!< 625K ohm */
#define TSC_RESR_CHN_RESIST_500K        (0x4UL) /*!< 500K ohm */
#define TSC_RESR_CHN_RESIST_375K        (0x5UL) /*!< 375K ohm */
#define TSC_RESR_CHN_RESIST_250K        (0x6UL) /*!< 250K ohm */
#define TSC_RESR_CHN_RESIST_125K        (0x7UL) /*!< 125K ohm */

/*****************  Bit definition for TSC_RESR0 register  *****************/
#define TSC_RESR0_CHN_RESIST0_SHIFT     (0U)  /*!< TSC_RESR 0 channel 0 */
#define TSC_RESR0_CHN_RESIST1_SHIFT     (4U)  /*!< TSC_RESR 0 channel 1 */
#define TSC_RESR0_CHN_RESIST2_SHIFT     (8U)  /*!< TSC_RESR 0 channel 2 */
#define TSC_RESR0_CHN_RESIST3_SHIFT     (12U) /*!< TSC_RESR 0 channel 3 */
#define TSC_RESR0_CHN_RESIST4_SHIFT     (16U) /*!< TSC_RESR 0 channel 4 */
#define TSC_RESR0_CHN_RESIST5_SHIFT     (20U) /*!< TSC_RESR 0 channel 5 */
#define TSC_RESR0_CHN_RESIST6_SHIFT     (24U) /*!< TSC_RESR 0 channel 6 */
#define TSC_RESR0_CHN_RESIST7_SHIFT     (28U) /*!< TSC_RESR 0 channel 7 */

/*****************  Bit definition for TSC_RESR1 register  *****************/
#define TSC_RESR1_CHN_RESIST8_SHIFT     (0U)  /*!< TSC_RESR 1 channel 8  */
#define TSC_RESR1_CHN_RESIST9_SHIFT     (4U)  /*!< TSC_RESR 1 channel 9  */
#define TSC_RESR1_CHN_RESIST10_SHIFT    (8U)  /*!< TSC_RESR 1 channel 10 */
#define TSC_RESR1_CHN_RESIST11_SHIFT    (12U) /*!< TSC_RESR 1 channel 11 */
#define TSC_RESR1_CHN_RESIST12_SHIFT    (16U) /*!< TSC_RESR 1 channel 12 */
#define TSC_RESR1_CHN_RESIST13_SHIFT    (20U) /*!< TSC_RESR 1 channel 13 */
#define TSC_RESR1_CHN_RESIST14_SHIFT    (24U) /*!< TSC_RESR 1 channel 14 */
#define TSC_RESR1_CHN_RESIST15_SHIFT    (28U) /*!< TSC_RESR 1 channel 15 */

/*****************  Bit definition for TSC_RESR2 register  *****************/
#define TSC_RESR2_CHN_RESIST16_SHIFT    (0U)  /*!< TSC_RESR 2 channel 16 */
#define TSC_RESR2_CHN_RESIST17_SHIFT    (4U)  /*!< TSC_RESR 2 channel 17 */
#define TSC_RESR2_CHN_RESIST18_SHIFT    (8U)  /*!< TSC_RESR 2 channel 18 */
#define TSC_RESR2_CHN_RESIST19_SHIFT    (12U) /*!< TSC_RESR 2 channel 19 */
#define TSC_RESR2_CHN_RESIST20_SHIFT    (16U) /*!< TSC_RESR 2 channel 20 */
#define TSC_RESR2_CHN_RESIST21_SHIFT    (20U) /*!< TSC_RESR 2 channel 21 */
#define TSC_RESR2_CHN_RESIST22_SHIFT    (24U) /*!< TSC_RESR 2 channel 22 */
#define TSC_RESR2_CHN_RESIST23_SHIFT    (28U) /*!< TSC_RESR 2 channel 23 */

/****************  Bit definition for TSC_THRHDx register       ****************/
#define TSC_THRHD_DELTA_SHIFT           (16U)
#define TSC_THRHD_DELTA_MASK            (0xFF << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA                 TSC_THRHD_DELTA_MASK    /*!<TSC_THRHD register delta bit */
#define TSC_THRHD_DELTA_0               (0x01UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_1               (0x02UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_2               (0x04UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_3               (0x08UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_4               (0x10UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_5               (0x20UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_6               (0x40UL << TSC_THRHD_DELTA_SHIFT)
#define TSC_THRHD_DELTA_7               (0x80UL << TSC_THRHD_DELTA_SHIFT)

#define TSC_THRHD_BASE_SHIFT            (0U)
#define TSC_THRHD_BASE_MASK             (0x7FFUL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE                  TSC_THRHD_BASE_MASK     /*!<TSC_THRHD register base bit */
#define TSC_THRHD_BASE_0                (0x001UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_1                (0x002UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_2                (0x004UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_3                (0x008UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_4                (0x010UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_5                (0x020UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_6                (0x040UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_7                (0x080UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_8                (0x100UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_9                (0x200UL << TSC_THRHD_BASE_SHIFT)
#define TSC_THRHD_BASE_10               (0x400UL << TSC_THRHD_BASE_SHIFT)

/******************************************************************************/
/*                                                                            */
/*                                 DVP Registers                              */
/*                                                                            */
/******************************************************************************/

