RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
/****************  Bit definition for DVP_CTRL register        ****************/
#define DVP_CTRL_FFSWRST_SHIFT              (16UL)
#define DVP_CTRL_FFSWRST_MASK               (0x1UL << DVP_CTRL_FFSWRST_SHIFT)
#define DVP_CTRL_FFSWRST                    (DVP_CTRL_FFSWRST_MASK)

#define DVP_CTRL_FWM_SHIFT                  (12UL)
#define DVP_CTRL_FWM_MASK                   (0x7UL << DVP_CTRL_FWM_SHIFT)
#define DVP_CTRL_FWM                        (DVP_CTRL_FWM_MASK)
#define DVP_CTRL_FWM_0                      (0x1UL << DVP_CTRL_FWM_SHIFT)
#define DVP_CTRL_FWM_1                      (0x2UL << DVP_CTRL_FWM_SHIFT)
#define DVP_CTRL_FWM_2                      (0x4UL << DVP_CTRL_FWM_SHIFT)

#define DVP_CTRL_LSM_SHIFT                  (9UL)
#define DVP_CTRL_LSM_MASK                   (0x7UL << DVP_CTRL_LSM_SHIFT)
#define DVP_CTRL_LSM                        (DVP_CTRL_LSM_MASK)
#define DVP_CTRL_LSM_0                      (0x1UL << DVP_CTRL_LSM_SHIFT)
#define DVP_CTRL_LSM_1                      (0x2UL << DVP_CTRL_LSM_SHIFT)
#define DVP_CTRL_LSM_2                      (0x4UL << DVP_CTRL_LSM_SHIFT)

#define DVP_CTRL_BSM_SHIFT                  (6UL)
#define DVP_CTRL_BSM_MASK                   (0x7UL << DVP_CTRL_BSM_SHIFT)
#define DVP_CTRL_BSM                        (DVP_CTRL_BSM_MASK)
#define DVP_CTRL_BSM_0                      (0x1UL << DVP_CTRL_BSM_SHIFT)
#define DVP_CTRL_BSM_1                      (0x2UL << DVP_CTRL_BSM_SHIFT)
#define DVP_CTRL_BSM_2                      (0x4UL << DVP_CTRL_BSM_SHIFT)

#define DVP_CTRL_DATINV_SHIFT               (5UL)
#define DVP_CTRL_DATINV_MASK                (0x1UL << DVP_CTRL_DATINV_SHIFT)
#define DVP_CTRL_DATINV                     (DVP_CTRL_DATINV_MASK)

#define DVP_CTRL_PCKPOL_SHIFT               (4UL)
#define DVP_CTRL_PCKPOL_MASK                (0x1UL << DVP_CTRL_PCKPOL_SHIFT)
#define DVP_CTRL_PCKPOL                     (DVP_CTRL_PCKPOL_MASK)

#define DVP_CTRL_VSPOL_SHIFT                (3UL)
#define DVP_CTRL_VSPOL_MASK                 (0x1UL << DVP_CTRL_VSPOL_SHIFT)
#define DVP_CTRL_VSPOL                      (DVP_CTRL_VSPOL_MASK)

#define DVP_CTRL_HSPOL_SHIFT                (2UL)
#define DVP_CTRL_HSPOL_MASK                 (0x1UL << DVP_CTRL_HSPOL_SHIFT)
#define DVP_CTRL_HSPOL                      (DVP_CTRL_HSPOL_MASK)

#define DVP_CTRL_CM_SHIFT                   (1UL)
#define DVP_CTRL_CM_MASK                    (0x1UL << DVP_CTRL_CM_SHIFT)
#define DVP_CTRL_CM                         (DVP_CTRL_CM_MASK)

#define DVP_CTRL_CAPTURE_SHIFT              (0UL)
#define DVP_CTRL_CAPTURE_MASK               (0x1UL << DVP_CTRL_CAPTURE_SHIFT)
#define DVP_CTRL_CAPTURE                    (DVP_CTRL_CAPTURE_MASK)

/****************  Bit definition for DVP_STS register        ****************/
#define DVP_STS_FCNT_SHIFT                  (1UL)
#define DVP_STS_FCNT_MASK                   (0x7UL << DVP_STS_FCNT_SHIFT)
#define DVP_STS_FCNT                        (DVP_STS_FCNT_MASK)
#define DVP_STS_FCNT_0                      (0x1UL << DVP_STS_FCNT_SHIFT)
#define DVP_STS_FCNT_1                      (0x2UL << DVP_STS_FCNT_SHIFT)
#define DVP_STS_FCNT_2                      (0x4UL << DVP_STS_FCNT_SHIFT)

#define DVP_STS_FNE_SHIFT                   (0UL)
#define DVP_STS_FNE_MASK                    (0x1UL << DVP_STS_FNE_SHIFT)
#define DVP_STS_FNE                         (DVP_STS_FNE_MASK)

/****************  Bit definition for DVP_INTSTS register     ****************/
#define DVP_INTSTS_HERRIS_SHIFT             (9UL)
#define DVP_INTSTS_HERRIS_MASK              (0x1UL << DVP_INTSTS_HERRIS_SHIFT)
#define DVP_INTSTS_HERRIS                   (DVP_INTSTS_HERRIS_MASK)

#define DVP_INTSTS_VERRIS_SHIFT             (8UL)
#define DVP_INTSTS_VERRIS_MASK              (0x1UL << DVP_INTSTS_VERRIS_SHIFT)
#define DVP_INTSTS_VERRIS                   (DVP_INTSTS_VERRIS_MASK)

#define DVP_INTSTS_FOIS_SHIFT               (7UL)
#define DVP_INTSTS_FOIS_MASK                (0x1UL << DVP_INTSTS_FOIS_SHIFT)
#define DVP_INTSTS_FOIS                     (DVP_INTSTS_FOIS_MASK)

#define DVP_INTSTS_FWIS_SHIFT               (6UL)
#define DVP_INTSTS_FWIS_MASK                (0x1UL << DVP_INTSTS_FWIS_SHIFT)
#define DVP_INTSTS_FWIS                     (DVP_INTSTS_FWIS_MASK)

#define DVP_INTSTS_FFIS_SHIFT               (5UL)
#define DVP_INTSTS_FFIS_MASK                (0x1UL << DVP_INTSTS_FFIS_SHIFT)
#define DVP_INTSTS_FFIS                     (DVP_INTSTS_FFIS_MASK)

#define DVP_INTSTS_FEIS_SHIFT               (4UL)
#define DVP_INTSTS_FEIS_MASK                (0x1UL << DVP_INTSTS_FEIS_SHIFT)
#define DVP_INTSTS_FEIS                     (DVP_INTSTS_FEIS_MASK)

#define DVP_INTSTS_LEIS_SHIFT               (3UL)
#define DVP_INTSTS_LEIS_MASK                (0x1UL << DVP_INTSTS_LEIS_SHIFT)
#define DVP_INTSTS_LEIS                     (DVP_INTSTS_LEIS_MASK)

#define DVP_INTSTS_LSIS_SHIFT               (2UL)
#define DVP_INTSTS_LSIS_MASK                (0x1UL << DVP_INTSTS_LSIS_SHIFT)
#define DVP_INTSTS_LSIS                     (DVP_INTSTS_LSIS_MASK)

#define DVP_INTSTS_FMEIS_SHIFT              (1UL)
#define DVP_INTSTS_FMEIS_MASK               (0x1UL << DVP_INTSTS_FMEIS_SHIFT)
#define DVP_INTSTS_FMEIS                    (DVP_INTSTS_FMEIS_MASK)

#define DVP_INTSTS_FMSIS_SHIFT              (0UL)
#define DVP_INTSTS_FMSIS_MASK               (0x1UL << DVP_INTSTS_FMSIS_SHIFT)
#define DVP_INTSTS_FMSIS                    (DVP_INTSTS_FMSIS_MASK)

/****************  Bit definition for DVP_INTEN register      ****************/
#define DVP_INTEN_DMAEN_SHIFT               (10UL)
#define DVP_INTEN_DMAEN_MASK                (0x1UL << DVP_INTEN_DMAEN_SHIFT)
#define DVP_INTEN_DMAEN                     (DVP_INTEN_DMAEN_MASK)

#define DVP_INTEN_HERRIE_SHIFT              (9UL)
#define DVP_INTEN_HERRIE_MASK               (0x1UL << DVP_INTEN_HERRIE_SHIFT)
#define DVP_INTEN_HERRIE                    (DVP_INTEN_HERRIE_MASK)

#define DVP_INTEN_VERRIE_SHIFT              (8UL)
#define DVP_INTEN_VERRIE_MASK               (0x1UL << DVP_INTEN_VERRIE_SHIFT)
#define DVP_INTEN_VERRIE                    (DVP_INTEN_VERRIE_MASK)

