RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/CMSIS/device/n32g4fr.h
#define DVP_INTEN_FOIE_SHIFT                (7UL)
#define DVP_INTEN_FOIE_MASK                 (0x1UL << DVP_INTEN_FOIE_SHIFT)
#define DVP_INTEN_FOIE                      (DVP_INTEN_FOIE_MASK)

#define DVP_INTEN_FWIE_SHIFT                (6UL)
#define DVP_INTEN_FWIE_MASK                 (0x1UL << DVP_INTEN_FWIE_SHIFT)
#define DVP_INTEN_FWIE                      (DVP_INTEN_FWIE_MASK)

#define DVP_INTEN_FFIE_SHIFT                (5UL)
#define DVP_INTEN_FFIE_MASK                 (0x1UL << DVP_INTEN_FFIE_SHIFT)
#define DVP_INTEN_FFIE                      (DVP_INTEN_FFIE_MASK)

#define DVP_INTEN_FEIE_SHIFT                (4UL)
#define DVP_INTEN_FEIE_MASK                 (0x1UL << DVP_INTEN_FEIE_SHIFT)
#define DVP_INTEN_FEIE                      (DVP_INTEN_FEIE_MASK)

#define DVP_INTEN_LEIE_SHIFT                (3UL)
#define DVP_INTEN_LEIE_MASK                 (0x1UL << DVP_INTEN_LEIE_SHIFT)
#define DVP_INTEN_LEIE                      (DVP_INTEN_LEIE_MASK)

#define DVP_INTEN_LSIE_SHIFT                (2UL)
#define DVP_INTEN_LSIE_MASK                 (0x1UL << DVP_INTEN_LSIE_SHIFT)
#define DVP_INTEN_LSIE                      (DVP_INTEN_LSIE_MASK)

#define DVP_INTEN_FMEIE_SHIFT               (1UL)
#define DVP_INTEN_FMEIE_MASK                (0x1UL << DVP_INTEN_FMEIE_SHIFT)
#define DVP_INTEN_FMEIE                     (DVP_INTEN_FMEIE_MASK)

#define DVP_INTEN_FMSIE_SHIFT               (0UL)
#define DVP_INTEN_FMSIE_MASK                (0x1UL << DVP_INTEN_FMSIE_SHIFT)
#define DVP_INTEN_FMSIE                     (DVP_INTEN_FMSIE_MASK)

/****************  Bit definition for DVP_MINTSTS register    ****************/
#define DVP_MINTSTS_HERRMIS_SHIFT           (9UL)
#define DVP_MINTSTS_HERRMIS_MASK            (0x1UL << DVP_MINTSTS_HERRMIS_SHIFT)
#define DVP_MINTSTS_HERRMIS                 (DVP_MINTSTS_HERRMIS_MASK)

#define DVP_MINTSTS_VERRMIS_SHIFT           (8UL)
#define DVP_MINTSTS_VERRMIS_MASK            (0x1UL << DVP_MINTSTS_VERRMIS_SHIFT)
#define DVP_MINTSTS_VERRMIS                 (DVP_MINTSTS_VERRMIS_MASK)

#define DVP_MINTSTS_FOMIS_SHIFT             (7UL)
#define DVP_MINTSTS_FOMIS_MASK              (0x1UL << DVP_MINTSTS_FOMIS_SHIFT)
#define DVP_MINTSTS_FOMIS                   (DVP_MINTSTS_FOMIS_MASK)

#define DVP_MINTSTS_FWMIS_SHIFT             (6UL)
#define DVP_MINTSTS_FWMIS_MASK              (0x1UL << DVP_MINTSTS_FWMIS_SHIFT)
#define DVP_MINTSTS_FWMIS                   (DVP_MINTSTS_FWMIS_MASK)

#define DVP_MINTSTS_FFMIS_SHIFT             (5UL)
#define DVP_MINTSTS_FFMIS_MASK              (0x1UL << DVP_MINTSTS_FFMIS_SHIFT)
#define DVP_MINTSTS_FFMIS                   (DVP_MINTSTS_FFMIS_MASK)

#define DVP_MINTSTS_FEMIS_SHIFT             (4UL)
#define DVP_MINTSTS_FEMIS_MASK              (0x1UL << DVP_MINTSTS_FEMIS_SHIFT)
#define DVP_MINTSTS_FEMIS                   (DVP_MINTSTS_FEMIS_MASK)

#define DVP_MINTSTS_LEMIS_SHIFT             (3UL)
#define DVP_MINTSTS_LEMIS_MASK              (0x1UL << DVP_MINTSTS_LEMIS_SHIFT)
#define DVP_MINTSTS_LEMIS                   (DVP_MINTSTS_LEMIS_MASK)

#define DVP_MINTSTS_LSMIS_SHIFT             (2UL)
#define DVP_MINTSTS_LSMIS_MASK              (0x1UL << DVP_MINTSTS_LSMIS_SHIFT)
#define DVP_MINTSTS_LSMIS                   (DVP_MINTSTS_LSMIS_MASK)

#define DVP_MINTSTS_FMEMIS_SHIFT            (1UL)
#define DVP_MINTSTS_FMEMIS_MASK             (0x1UL << DVP_MINTSTS_FMEMIS_SHIFT)
#define DVP_MINTSTS_FMEMIS                  (DVP_MINTSTS_FMEMIS_MASK)

#define DVP_MINTSTS_FMSMIS_SHIFT            (0UL)
#define DVP_MINTSTS_FMSMIS_MASK             (0x1UL << DVP_MINTSTS_FMSMIS_SHIFT)
#define DVP_MINTSTS_FMSMIS                  (DVP_MINTSTS_FMSMIS_MASK)

/****************  Bit definition for DVP_WST register      ****************/
#define DVP_WST_VST_SHIFT                   (13UL)
#define DVP_WST_VST_MASK                    (0x7FFUL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST                         (DVP_WST_VST_MASK)
#define DVP_WST_VST_0                       (0x001UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_1                       (0x002UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_2                       (0x004UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_3                       (0x008UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_4                       (0x010UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_5                       (0x020UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_6                       (0x040UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_7                       (0x080UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_8                       (0x100UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_9                       (0x200UL << DVP_WST_VST_SHIFT)
#define DVP_WST_VST_10                      (0x400UL << DVP_WST_VST_SHIFT)

#define DVP_WST_HST_SHIFT                   (0UL)
#define DVP_WST_HST_MASK                    (0x7FFUL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST                         (DVP_WST_HST_MASK)
#define DVP_WST_HST_0                       (0x001UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_1                       (0x002UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_2                       (0x004UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_3                       (0x008UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_4                       (0x010UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_5                       (0x020UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_6                       (0x040UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_7                       (0x080UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_8                       (0x100UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_9                       (0x200UL << DVP_WST_HST_SHIFT)
#define DVP_WST_HST_10                      (0x400UL << DVP_WST_HST_SHIFT)

/****************  Bit definition for DVP_WSIZE register   ****************/
#define DVP_WSIZE_VLINE_SHIFT               (13UL)
#define DVP_WSIZE_VLINE_MASK                (0x7FFUL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE                     (DVP_WSIZE_VLINE_MASK)
#define DVP_WSIZE_VLINE_0                   (0x001UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_1                   (0x002UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_2                   (0x004UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_3                   (0x008UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_4                   (0x010UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_5                   (0x020UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_6                   (0x040UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_7                   (0x080UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_8                   (0x100UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_9                   (0x200UL << DVP_WSIZE_VLINE_SHIFT)
#define DVP_WSIZE_VLINE_10                  (0x400UL << DVP_WSIZE_VLINE_SHIFT)

#define DVP_WSIZE_HCNT_SHIFT                (0UL)
#define DVP_WSIZE_HCNT_MASK                 (0x7FFUL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT                      (DVP_WSIZE_HCNT_MASK)
#define DVP_WSIZE_HCNT_0                    (0x001UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_1                    (0x002UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_2                    (0x004UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_3                    (0x008UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_4                    (0x010UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_5                    (0x020UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_6                    (0x040UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_7                    (0x080UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_8                    (0x100UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_9                    (0x200UL << DVP_WSIZE_HCNT_SHIFT)
#define DVP_WSIZE_HCNT_10                   (0x400UL << DVP_WSIZE_HCNT_SHIFT)

/****************  Bit definition for DVP_FIFO register   ****************/
#define DVP_FIFO_DAT3_SHIFT                 (24UL)
#define DVP_FIFO_DAT3_MASK                  (0xFFUL << DVP_FIFO_DAT3_SHIFT)
#define DVP_FIFO_DAT3                       (DVP_FIFO_DAT3_MASK)

#define DVP_FIFO_DAT2_SHIFT                 (16UL)
#define DVP_FIFO_DAT2_MASK                  (0xFFUL << DVP_FIFO_DAT2_SHIFT)
#define DVP_FIFO_DAT2                       (DVP_FIFO_DAT2_MASK)

#define DVP_FIFO_DAT1_SHIFT                 (8UL)
#define DVP_FIFO_DAT1_MASK                  (0xFFUL << DVP_FIFO_DAT1_SHIFT)
#define DVP_FIFO_DAT1                       (DVP_FIFO_DAT1_MASK)

#define DVP_FIFO_DAT0_SHIFT                 (0UL)
#define DVP_FIFO_DAT0_MASK                  (0xFFUL << DVP_FIFO_DAT0_SHIFT)
#define DVP_FIFO_DAT0                       (DVP_FIFO_DAT0_MASK)

/**
 * @}
 */

/** @addtogroup Exported_macros
  * @{
  */

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))
    
#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))
    
#define READ_BIT(REG, BIT)    ((REG) & (BIT))
    
#define CLEAR_REG(REG)        ((REG) = (0x0))
    
#define WRITE_REG(REG, VAL)   ((REG) = (VAL))
    
#define READ_REG(REG)         ((REG))
    
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))
/**
 * @}
 */

#ifdef USE_STDPERIPH_DRIVER
#include "n32g4fr_conf.h"
#endif

#ifdef __cplusplus
}
#endif

#endif /* __N32G4FR_H__ */
